app/Controllers/Actividad.php

    public function ver()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $ActividadM=model('ActividadModel');
        $data['actividad']=$ActividadM->findAll();
---
SELECT *
FROM `Actividad`