app/Controllers/Actividad.php

    public function editar($idactividad)
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $ActividadM=model('ActividadModel');
        $data['actividad']=$ActividadM->where('idActividad',$idactividad)->findAll();
---
SELECT *
FROM `Actividad`
WHERE `idActividad` = '60'

                $data['foto']="images/actividad/".$newFileName;
        }
    }
        $ActividadM->set($data)->where('idActividad',$idActividad)->update();
---
UPDATE `Actividad` SET `nombre` = 'Evento con influencer', `fecha` = '2024-12-04', `horaI` = '11:25:00', `horaF` = '11:25:00', `tipoAct` = 'Funcional', `descripcion` = 'Debes de consumer menos carbohidratos y mas proteina', `dificultad` = 'avanzado', `objetivo` = 'fuerza', `capacidad` = '15', `idEntrenador` = '6', `foto` = 'images/actividad/actividad_62..png', `updated_at` = '2024-11-24 17:44:09'
WHERE `idActividad` = '62'