app/Controllers/Dieta.php

SELECT *
FROM `Dieta`
---
    public function ver()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $dietaM=model('DietaM');
        $data['dieta']=$dietaM->findAll();