app/Controllers/Equipo.php

SELECT *
FROM `Equipo`
---
    public function ver()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $equipoM=model('EquipoM');
        $data['equipo']=$equipoM->findAll();