app/Controllers/Pago.php

SELECT *
FROM `Pago`
---
    public function ver()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=0){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $pagoM=model('PagoM');
        $data['pago']=$pagoM->findAll();

INSERT INTO `Pago` (`metodo`, `monto`, `fechaPago`, `idSocio`, `fechaFinPago`, `created_at`, `updated_at`) VALUES ('Trasferencia', '300', '2024-11-16', '6', '2024-11-16', '2024-11-16 20:33:12', '2024-11-16 20:33:12')
---
             view('footer');
           }else{
            $pagoM=model('PagoM');
            $pagoM->insert($data);