app/Controllers/Rutina.php

    public function ver()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $RutinaM=model('RutinaM');
        $data['rutina']=$RutinaM->findAll();
---
SELECT *
FROM `Rutina`