app/Controllers/SocioRutina.php

    public function insertar()
    {
        $session=session();
        if($session->get('logged_in')!=true || $session->get('tipo')!=1){
             return redirect()->to(base_url('/login'));
        }
        $data1 ['nombre']=$session->get('alias');
        $SocioRutinaM=model('SocioRutinaModel');
        $data["socioRutina"]=$SocioRutinaM->findAll();
---
SELECT *
FROM `SocioRutina`

             view('footer');
           }else{
            $SocioRutinaM=model('SocioRutinaModel');
            $SocioRutinaM->insert($data);
---
INSERT INTO `SocioRutina` (`idRutina`, `idSocio`, `fechaInicio`, `fechaFin`, `idEntrenador`, `created_at`, `updated_at`) VALUES ('3', '14', '2024-11-19', '2025-01-19', '6', '2024-11-19 18:23:46', '2024-11-19 18:23:46')