app/Controllers/Usuario.php

INSERT INTO `Usuario` (`alias`, `nombre`, `apellidoP`, `apellidoM`, `cta`, `tipo`, `sexo`, `fechaNacimiento`, `telefonoM`, `telefonoC`, `correo`, `created_at`, `updated_at`) VALUES ('Jairo', 'Jair', 'Hernandez', 'Gregorio', 'areli', '1', 'M', '2002-03-01', '231233123', '2312334312', 'jairesgay@gmai.com', '2024-11-11 21:02:53', '2024-11-11 21:02:53')
---
             view('footer');
           }else{
            $usuarioM=model('UsuarioM');
            $usuarioM->insert($usuario);

INSERT INTO `Entrenador` (`especialidad`, `curp`, `foto`, `certificaciones`, `idUsuario`, `created_at`, `updated_at`) VALUES ('perdidaPeso', 'jair09', '22TE0034.jpeg', 'Rascarse la barriga', 30, '2024-11-11 21:02:53', '2024-11-11 21:02:53')
---
                   view('footer');
           }else{
           $entrenadorM=model('EntrenadorModel');
           $entrenadorM->insert($entrenador);